# 1. Створіть функцію, яка приймає список, та індекс
# 	початку сортування та індекс кінця сортування,
# 	і повертає список у якому відсортовані лише ті елементи,
# 	які укладені між індексом початку сортування та індексом
# 	кінця сортування.
# Наприклад:
#         [1, 10, 9, 4, 5, 7, 2, 0], 2, 6
# Відповідь
#         [1, 10, 4, 5, 7, 9, 2, 0]
# У відповіді повернути ПОЧАТОКОВИЙ список, але з відсортованою частиною!

def sort_list(lst:list, start:int, end:int):
    #
    res = lst[:start] + sorted(lst[start:end]) + lst[end:]
    return res

print(sort_list([1, 10, 9, 4, 5, 7, 2, 0], 2, 6))

# 2. Написати програму, яка вирішує математичний приклад з файлу (file_1.txt),
# 	а також записує результат назад до файлу.
#     Приклад:
#         Рядок у файлі
# 		34 + 22 - 11*10
# 		Після роботи вашої програми
# 		34 + 22 - 11 * 10 = -54
# 		Тобто у файл записується відповідь після обчислення!
# 		(тобто приклад символ дорівнює і відповідь, потрібно записати
# 		у кожному рядку файлу)
# 		Файл із завданням у додатку до дз.
