# 1. Як відомо, у КШІ Раштрапаті (президент) обирається не прямим голосуванням,
# 	а шляхом дворівневого голосування. Спочатку проводяться вибори у кожному штаті та визначається переможець
# 	виборів у даному штаті. Потім проводяться державні вибори: на цих виборах кожен штат має певну
# 	кількість голосів — кількість виборців від цього штату. На практиці всі виборці від штату голосують
# 	відповідно до результатів голосування всередині штату, тобто на заключній стадії виборів у голосуванні
# 	беруть участь штати, які мають різну кількість голосів.
# 	Кожен запис містить прізвище кандидата та кількість голосів, відданих за нього в одному зі штатів.
# 	Підрахуйте підсумки виборів: для кожного з учасників голосування визначте кількість відданих за нього голосів.
# 	Також визначте переможця та виведіть його прізвище з написом переможець.
# 	вхідні дані для перевірки доклав у файлі (input.txt)

with open('input.txt') as fl:
    lines = fl.readlines()

    result = {}
    for line in lines:
        parts = line.split()
        result[parts[0]] = (0 if parts[0] not in result else result[parts[0]]) + int(parts[1])

print(f'Your new president is: {max(result, key=result.get)} with {max(result.values())} total points')


# 2. Годинник показує h годин, m хвилин і s секунд після півночі.
# 	Ваше завдання — написати функцію, яка повертає час з опівночі в мілісекундах.
# 	Приклад:
# 	h = 0
# 	m = 1
# 	s = 1
#
# 	result = 61000

# def time(h:int, m:int, s:int):
#     sec_ms = 1000 # ms/sec
#     min_ms = 60000 # ms/min
#     hour_ms = 3600 * 1000 # ms/hour
#     return f'У часі який ви вказали {(h * hour_ms) + (m * min_ms) + (s * sec_ms)} мілісекунд '
#
# print(time(9, 1, 1))

# 3. Дано два цілі числа a і b, які можуть бути додатними або від’ємними, знайти суму всіх цілих
# 	чисел між ними та повернути її. Якщо два числа рівні, поверніть a або b.
# 	(1, 0) ➞ 	1 	(1 + 0 = 1)
# 	(1, 2) ➞ 	3 	(1 + 2 = 3)
# 	(0, 1) ➞ 	1 	(0 + 1 = 1)
# 	(1, 1) ➞ 	1 	(1)
# 	(-1, 0) ➞ 	-1 	(-1 + 0 = -1)
# 	(-1, 2) ➞ 	2 	(-1 + 0 + 1 + 2 = 2)

def count(a:int, b:int):
    temp = []
    if a < b:
        for i in range(a, b + 1):
            temp.append(i)
        return sum(temp)
    elif a > b:
        for j in range(b, a + 1):
            temp.append(j)
        return sum(temp)
    else:
        return a

print(count(5,5))


